Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.0.23/samha0ab/atdf/ATSAMHA0E15AB.atdf
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAMHAxE" caption="SAMHAxE">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PA02"/>
      <pin position="4" pad="PA03"/>
      <pin position="5" pad="VCC"/>
      <pin position="6" pad="GND"/>
      <pin position="7" pad="PA06"/>
      <pin position="8" pad="PA07"/>
      <pin position="9" pad="VDDANA"/>
      <pin position="10" pad="GNDIO"/>
      <pin position="11" pad="PA08"/>
      <pin position="12" pad="PA09"/>
      <pin position="13" pad="EN"/>
      <pin position="14" pad="NRES"/>
      <pin position="15" pad="PA14"/>
      <pin position="16" pad="PA15"/>
      <pin position="17" pad="PA16"/>
      <pin position="18" pad="PA17"/>
      <pin position="19" pad="PA18"/>
      <pin position="20" pad="PA19"/>
      <pin position="21" pad="PA20"/>
      <pin position="22" pad="GND_LIN"/>
      <pin position="23" pad="LIN"/>
      <pin position="24" pad="VS"/>
      <pin position="25" pad="PA27"/>
      <pin position="26" pad="RESET_N"/>
      <pin position="27" pad="PA28"/>
      <pin position="28" pad="GNDIO"/>
      <pin position="29" pad="VDDCORE"/>
      <pin position="30" pad="VDDIN"/>
      <pin position="31" pad="PA30"/>
      <pin position="32" pad="PA31"/>
      <pin position="RXD" pad="PB11" type="INTERNAL_33"/>
      <pin position="TXD" pad="PA13" type="INTERNAL_34"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>